export const option = {
  columns: ['书柜', '借出图书量', '归还图书量'],
  rows: [{
      '书柜': '1#书柜',
      '借出图书量': 1393,
      '归还图书量': 1093
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 3530,
      '归还图书量': 3230
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 2923,
      '归还图书量': 2623
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 1723,
      '归还图书量': 1423
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 3792,
      '归还图书量': 3492
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 4593,
      '归还图书量': 4293
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 1393,
      '归还图书量': 1093
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 3530,
      '归还图书量': 3230
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 2923,
      '归还图书量': 2623
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 1723,
      '归还图书量': 1423
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 3792,
      '归还图书量': 3492
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 4593,
      '归还图书量': 4293
    }, {
      '书柜': '1#书柜',
      '借出图书量': 1393,
      '归还图书量': 1093
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 3530,
      '归还图书量': 3230
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 2923,
      '归还图书量': 2623
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 1723,
      '归还图书量': 1423
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 3792,
      '归还图书量': 3492
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 4593,
      '归还图书量': 4293
    }, {
      '书柜': '1#书柜',
      '借出图书量': 1393,
      '归还图书量': 1093
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 3530,
      '归还图书量': 3230
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 2923,
      '归还图书量': 2623
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 1723,
      '归还图书量': 1423
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 3792,
      '归还图书量': 3492
    },
    {
      '书柜': '1#书柜',
      '借出图书量': 4593,
      '归还图书量': 4293
    },
  ]
}

export const settings = {
  textStyle: {
    color: '#818E95',
    fontSize: 12,
    fontWeight: 'normal'
  },
  legend: {
    right: 0,
    textStyle: {
      color: '#818E95',
      fontStyle: 'normal',
      fontSize: 12
    }
  },
  tooltip: {
    backgroundColor: '#805FFE'
  },
  series(v) {
    v.forEach(i => {
      i.barWidth = 16
      if (i.name === '借出图书量') {
        i.itemStyle = {
          color: '#FBBC0E',
          barBorderRadius: 4
        }
      } else {
        i.itemStyle = {
          color: '#5490EF',
          barBorderRadius: 4
        }
      }
    })
    return v
  },
  dataZoom: {
    show: true,
    type: 'slider',
    start: 0,
    end: 30
  }
}
